#Вариант 4

mass = {
    'A': 89.048, 'C': 121.020, 'D': 133.038, 'E': 147.053, 'F': 165.079,
    'G': 75.032, 'H': 155.069, 'I': 131.095, 'K': 146.106, 'L': 131.095,
    'M': 149.051, 'N': 132.053, 'P': 115.063, 'Q': 146.069, 'R': 174.112,
    'S': 105.043, 'T': 119.058, 'V': 117.079, 'W': 204.090, 'Y': 181.074
}
seq = input("Введите последовательность: ").strip().upper()
if not set(seq) <= mass.keys():
    print("Ошибка: недопустимые символы.")
else:
    print(f"Масса белка: {sum(mass[a] for a in seq) + 18.01056:.5f}")
